"""
1. Переписать код из homework6 используя ООП

2. Реализовать класс "очередь" https://en.wikipedia.org/wiki/Queue_(abstract_data_type)
- в качестве инициализации принимает размер очереди, если параметр не указан, то очередь - бесконечная
- выдать сообщение об ошибке, если в полную очередь добавить элемент нельзя, или из пустой очереди достать элемент

3. Реализовать класс "стек" https://en.wikipedia.org/wiki/Stack_(abstract_data_type)
- в качестве инициализации принимает размер стека, если параметр не указан, то стек - бесконечный
- выдать сообщение об ошибке, если в полный стек добавить элемент нельзя, или из пустого стека достать элемент
"""
